In [1]:
import pandas as pd
import numpy as np

## DATA SERIES

In [2]:
labels = ['a','b','c']
my_data=[10,20,30]
arr =np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [10]:
ser1= pd.Series([1,2,3,4],['USA','UK','Japan','USSR'])

In [11]:
ser1

USA      1
UK       2
Japan    3
USSR     4
dtype: int64

In [12]:
ser2= pd.Series([1,2,5,4],['USA','UK','Germany','USSR'])

In [13]:
ser2

USA        1
UK         2
Germany    5
USSR       4
dtype: int64

In [14]:
ser2['USA']

1

In [15]:
ser1 + ser2

Germany    NaN
Japan      NaN
UK         4.0
USA        2.0
USSR       8.0
dtype: float64

## DATAFRAMES

### intro to Dataframe Basics

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)

## Creating a DataFrame
### pd. DataFrame(data, index , columnnames)

In [21]:
df= pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [22]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [24]:
df["W"]

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [25]:
type(df["W"])

pandas.core.series.Series

In [26]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df[["W","Z"]]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [29]:
df['new'] = df["W"] + df["Z"]d

In [30]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.992897
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [32]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [33]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.992897
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [34]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [37]:
df.drop("E",axis=0)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [39]:
df.shape # 5 Rows and 4 columns

(5, 4)

In [40]:
df['X'] # Selecting Columns

A    0.196800
B   -0.156598
C   -0.610259
D   -0.479448
E    1.862864
Name: X, dtype: float64

In [41]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

## Selecting Rows

In [42]:
df.loc['D']

W    0.147027
X   -0.479448
Y    0.558769
Z    1.024810
Name: D, dtype: float64

In [45]:
df.iloc[3]

W    0.147027
X   -0.479448
Y    0.558769
Z    1.024810
Name: D, dtype: float64

In [51]:
df.loc['A',['W','Y']]

W   -0.993263
Y   -1.136645
Name: A, dtype: float64

In [53]:
type(df.loc['A',['W','Y']])

pandas.core.series.Series

In [52]:
df.loc[['A','C'],['W','Y']]

          W         Y
A -0.993263 -1.136645
C  2.154846 -0.755325

In [54]:
type(df.loc[['A','C'],['W','Y']])

pandas.core.frame.DataFrame

### Conditional Selection

In [55]:
df= pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [57]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [61]:
df["W"]>0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [65]:
df[df["W"]>0]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [63]:
df > 0

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [64]:
df[df > 0]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [67]:
df[df["W"]>0]['X']

A    2.084019
B    1.035125
E    1.192241
Name: X, dtype: float64

In [68]:
type(df[df["W"]>0]['X'])

pandas.core.series.Series

In [69]:
df[df["W"]>0][['X','Y']]

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
E  1.192241 -1.046780

In [70]:
type(df[df["W"]>0][['X','Y']])

pandas.core.frame.DataFrame

In [76]:
df[(df["W"]>0) & (df["Y"]<0)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [82]:
df[(df["W"]>0) and (df["Y"]<0)] # should use & and not and

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [80]:
df[(df["W"]<0) | (df["Y"]>0)]

          W         X         Y         Z
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [83]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [84]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [85]:
newind= "CA NY WY OR CO".split()

In [86]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [87]:
df["States"] = newind

In [88]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [89]:
df.set_index("States")

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [90]:
outside = ['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [92]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [93]:
inside

[1, 2, 3, 1, 2, 3]

In [95]:
hier_index=list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [96]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [97]:
df= pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [98]:
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [100]:
df.loc['G1']

          A         B
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [104]:
df.loc['G1'].loc[1]

A   -1.467514
B   -0.494095
Name: 1, dtype: float64

In [105]:
df.index.names=["Groups","Num"]

In [106]:
df

                   A         B
Groups Num
G1     1   -1.467514 -0.494095
       2   -0.162535  0.485809
       3    0.392489  0.221491
G2     1   -0.855196  1.541990
       2    0.666319 -0.538235
       3   -0.568581  1.407338

In [107]:
df.loc['G2'].loc[2]['B']

-0.5382346255173922

In [108]:
df.xs(1,level="Num")

               A         B
Groups
G1     -1.467514 -0.494095
G2     -0.855196  1.541990

### Missing Values

In [109]:
dummy={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df= pd.DataFrame(dummy)

In [110]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [111]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [112]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [113]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [114]:
df.fillna(value=1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [115]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [116]:
df['A'].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### GROUP by

In [117]:
data= {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Venessa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350]}

In [118]:
df= pd.DataFrame(data)

In [119]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [121]:
byCompany = df.groupby("Company")

In [122]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [123]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [124]:
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [125]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [126]:
df.groupby("Company").sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [127]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [128]:
df.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Venessa    340

In [129]:
df.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [130]:
df.groupby("Company").describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Merging , Joining and Concatinating